Revit 2024 API
View3D.HideGridsOnLevel Method
 This method hides the grid lines in this 3D view on the given Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void HideGridsOnLevel(
	ElementId levelId
)
Visual Basic
Public Sub HideGridsOnLevel ( _
	levelId As ElementId _
)
Visual C++
public:
void HideGridsOnLevel(
	ElementId^ levelId
)
Parameters
levelId
Type: Autodesk.Revit.DB.ElementId
 The id of the Level where grids will not be displayed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
View3D Class
Autodesk.Revit.DB Namespace